; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v7 - type_2 ?v8 - type_3)
 	      (pred_4 ?v5 - object ?v8 - type_3)
	      (pred_1 ?v7 - type_2 ?v2 - type_1)
	      (pred_2 ?v7 - type_2 ?v5 - object ?v2 - type_1))

   (:action op_3
       :parameters  (?v7 - type_2 ?v3 ?v1 - type_3)
       :precondition (and  (pred_3 ?v7 ?v3))
       :effect (and  (pred_3 ?v7 ?v1)
		     (not (pred_3 ?v7 ?v3))))

   (:action op_2
       :parameters (?v7 - type_2 ?v6 - object ?v4 - type_3 ?v2 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v4) (pred_3 ?v7 ?v4) (pred_1 ?v7 ?v2))
       :effect (and (pred_2 ?v7 ?v6 ?v2)
		    (not (pred_4 ?v6 ?v4)) 
		    (not (pred_1 ?v7 ?v2))))

   (:action op_1
       :parameters (?v7 - type_2 ?v6 - object ?v4 - type_3 ?v2 - type_1)
       :precondition  (and  (pred_2 ?v7 ?v6 ?v2) (pred_3 ?v7 ?v4))
       :effect (and (pred_4 ?v6 ?v4)
		    (pred_1 ?v7 ?v2)
		    (not (pred_2 ?v7 ?v6 ?v2)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_01 - type_2
obj_08 obj_07 - type_1
obj_04 obj_02 obj_06 - type_3
obj_03 obj_05 obj_09 - object)
(:init
(pred_3 obj_01 obj_02)
(pred_1 obj_01 obj_08)
(pred_1 obj_01 obj_07)
(pred_4 obj_03 obj_04)
(pred_4 obj_05 obj_04)
(pred_4 obj_09 obj_06)
)
(:goal
(and
(pred_4 obj_03 obj_04)
(pred_4 obj_05 obj_02)
(pred_4 obj_09 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_01 ?b obj_07))))
)
)

; plan
1. (op_3 obj_01 obj_02 obj_04)
   deleted: (pred_3 obj_01 obj_02)
   added: (pred_3 obj_01 obj_04)
   goals met: 1 of 3
2. (op_2 obj_01 obj_05 obj_04 obj_08)
   deleted: (pred_4 obj_05 obj_04) (pred_1 obj_01 obj_08)
   added: (pred_2 obj_01 obj_05 obj_08)
   goals met: 1 of 3
3. (op_3 obj_01 obj_04 obj_02)
   deleted: (pred_3 obj_01 obj_04)
   added: (pred_3 obj_01 obj_02)
   goals met: 1 of 3
4. (op_1 obj_01 obj_05 obj_02 obj_08)
   deleted: (pred_2 obj_01 obj_05 obj_08)
   added: (pred_4 obj_05 obj_02) (pred_1 obj_01 obj_08)
   goals met: 2 of 3
5. (op_3 obj_01 obj_02 obj_06)
   deleted: (pred_3 obj_01 obj_02)
   added: (pred_3 obj_01 obj_06)
   goals met: 2 of 3
6. (op_2 obj_01 obj_09 obj_06 obj_08)
   deleted: (pred_4 obj_09 obj_06) (pred_1 obj_01 obj_08)
   added: (pred_2 obj_01 obj_09 obj_08)
   goals met: 2 of 3
7. (op_3 obj_01 obj_06 obj_04)
   deleted: (pred_3 obj_01 obj_06)
   added: (pred_3 obj_01 obj_04)
   goals met: 2 of 3
8. (op_1 obj_01 obj_09 obj_04 obj_08)
   deleted: (pred_2 obj_01 obj_09 obj_08)
   added: (pred_4 obj_09 obj_04) (pred_1 obj_01 obj_08)
   goals met: 3 of 3
